from possible_losses import split_list, split_list_to_list_of_tuples, calculate_min_sum_of_losses


def test_split_list_1():
    dish_price_list = split_list(["Селедка 10", "Треска 15", "Курица 5", "Индейка 10",
                                  "Заяц 11", "Волк 25", "Рис 1", "Гречка 1",
                                  "Мороженое 5", "Торт 100", "Балык 200", "Филейчик 250",
                                  "Вино 300", "Пиво 100", "Ч/хлеб 1", "Б/хлеб 3",
                                  "Лимон 3", "Лайм 10", "Печенье 3", "Сухари 1",
                                  "Чай 5", "Кофе 1"])
    assert dish_price_list == ["Селедка", 10, "Треска", 15, "Курица", 5, "Индейка", 10,
                               "Заяц", 11, "Волк", 25, "Рис", 1, "Гречка", 1,
                               "Мороженое", 5, "Торт", 100, "Балык", 200, "Филейчик", 250,
                               "Вино", 300, "Пиво", 100, "Ч/хлеб", 1, "Б/хлеб", 3,
                               "Лимон", 3, "Лайм", 10, "Печенье", 3, "Сухари", 1,
                               "Чай", 5, "Кофе", 1]


def test_split_list_to_list_of_tuples_1():
    list_of_tuples = split_list_to_list_of_tuples(["Селедка", 10, "Треска", 15, "Курица", 5, "Индейка", 10,
                                                   "Заяц", 11, "Волк", 25, "Рис", 1, "Гречка", 1,
                                                   "Мороженое", 5, "Торт", 100, "Балык", 200, "Филейчик", 250,
                                                   "Вино", 300, "Пиво", 100, "Ч/хлеб", 1, "Б/хлеб", 3,
                                                   "Лимон", 3, "Лайм", 10, "Печенье", 3, "Сухари", 1,
                                                   "Чай", 5, "Кофе", 1])
    assert list_of_tuples == [("Селедка", 10), ("Треска", 15), ("Курица", 5), ("Индейка", 10),
                              ("Заяц", 11), ("Волк", 25), ("Рис", 1), ("Гречка", 1),
                              ("Мороженое", 5), ("Торт", 100), ("Балык", 200), ("Филейчик", 250),
                              ("Вино", 300), ("Пиво", 100), ("Ч/хлеб", 1), ("Б/хлеб", 3),
                              ("Лимон", 3), ("Лайм", 10), ("Печенье", 3), ("Сухари", 1),
                              ("Чай", 5), ("Кофе", 1)]


def test_calculate_min_sum_of_losses_1():
    min_sum = calculate_min_sum_of_losses([("Селедка", 10), ("Треска", 15), ("Курица", 5), ("Индейка", 10),
                                           ("Заяц", 11), ("Волк", 25), ("Рис", 1), ("Гречка", 1),
                                           ("Мороженое", 5), ("Торт", 100), ("Балык", 200), ("Филейчик", 250),
                                           ("Вино", 300), ("Пиво", 100), ("Ч/хлеб", 1), ("Б/хлеб", 3),
                                           ("Лимон", 3), ("Лайм", 10), ("Печенье", 3), ("Сухари", 1),
                                           ("Чай", 5), ("Кофе", 1)])
    assert min_sum == 338


def test_split_list_2():
    dish_price_list = split_list(["Селедка 10", "Треска 15", "Курица 5", "Индейка 10",
                                  "Заяц 11", "Волк 25", "Рис 1", "Гречка 1",
                                  "Мороженое 5", "Торт 100"])
    assert dish_price_list == ["Селедка", 10, "Треска", 15, "Курица", 5, "Индейка", 10,
                               "Заяц", 11, "Волк", 25, "Рис", 1, "Гречка", 1,
                               "Мороженое", 5, "Торт", 100]


def test_split_list_to_list_of_tuples_2():
    list_of_tuples = split_list_to_list_of_tuples(["Селедка", 10, "Треска", 15, "Курица", 5, "Индейка", 10,
                                                   "Заяц", 11, "Волк", 25, "Рис", 1, "Гречка", 1,
                                                   "Мороженое", 5, "Торт", 100])
    assert list_of_tuples == [("Селедка", 10), ("Треска", 15), ("Курица", 5), ("Индейка", 10),
                              ("Заяц", 11), ("Волк", 25), ("Рис", 1), ("Гречка", 1),
                              ("Мороженое", 5), ("Торт", 100)]


def test_calculate_min_sum_of_losses_2():
    min_sum = calculate_min_sum_of_losses([("Селедка", 10), ("Треска", 15), ("Курица", 5), ("Индейка", 10),
                                           ("Заяц", 11), ("Волк", 25), ("Рис", 1), ("Гречка", 1),
                                           ("Мороженое", 5), ("Торт", 100)])
    assert min_sum == 20032
